package az.babayev.javarush.javasyntax.task.task04;

/*
Вывести на экран числа от 1 до 10 включительно, используя цикл while.
Каждое значение с новой строки.
 */
public class Task10_01 {
    public static void main(String[] args) {
        int i = 1;
        while (i <= 10) {
            System.out.println(i);
            i++;
        }
    }

}
