package az.babayev.javarush.javasyntax.task.task03;
/*
Вывести на экран десять раз надпись
"Я хочу большую зарплату, и для этого изучаю Java"
 */
public class Task12_01 {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        }
    }

}
