package az.babayev.javarush.javasyntax.task.task03;
/*
Вывести на экран дату своего рождения в виде:
MAY 1 2012
 */
public class Task4_01 {
    public static void main(String[] args) {
        System.out.println("MAY 1 2012");
    }
}
