package az.babayev.javarush.javacore.task.task1.task1105;
/*
Исправь девять классов: Worker (сотрудник), Clerk (клерк), IT (ИТ-специалист),
Programmer (программист), ProjectManager (менеджер проекта),
CTO (технический директор), HR (рекрутер), OfficeManager (офис-менеджер),
Cleaner (уборщик).
Унаследуй программиста, менеджера проекта и технического директора от ИТ-специалиста.
Унаследуй рекрутера, уборщика и офис-менеджера от клерка.
Унаследуй клерка и ИТ-специалиста от сотрудника.
 */
public class Worker {
}
