package az.babayev.javarush.javasyntax.task.task01;

/*
В методе main напиши код, чтобы в результате выполнения программы
было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки.
Не убирай вывод строчки "Мое любимое стихотворение:".
 */
public class Task8_06 {
    public static void main(String[] args) {
        System.out.println("    Мое любимое стихотворение:");
        System.out.println("""
                Чтоб мудро жизнь прожить, знать надобно немало,
                Два важных правила запомни для начала:
                Ты лучше голодай, чем что попало есть,
                И лучше будь один, чем вместе с кем попало.""");
    }

}
