package az.babayev.javarush.javasyntax.task.task01;

/*
Написать программу,
выводящую на экран надпись "Элли самая красивая" 5 раз.
 Каждый раз - с новой строки.
 */
public class Task3 {
    public static void main(String[] args) {
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
    }
}
