package az.babayev.javarush.javasyntax.task.task01;
/*
Напиши программу, которая выводит на экран надпись:
"Хочешь - решай задачи, не хочешь - решай нехотя" 16 раз.
 */
public class Task8_02 {
    public static void main(String[] args) {
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    }

}
