package az.babayev.javarush.javasyntax.task.task01;

/*
Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.
 */
public class Task4 {
    public static void main(String[] args) {
        System.out.println(3126 - 8);
    }
}
