package az.babayev.javarush.javasyntax.lection9;
/*
В классе LiteralInteger объявлены четыре публичных поля, которые соответствуют четырем целочисленным типам.
При объявлении эти поля инициализируются разными значениями — целочисленными литералами.
Но программа не компилируется, и нужно это исправить. Для этого внеси минимальные изменения
в значения полей так, чтобы тип переменной соответствовал типу целочисленного литерала.
Можно изменять только знак и тип литерала, не изменяя цифры и их порядок.
 */
public class LiteralInteger {
}
